export const officeLocations = [
  {
    lat: 23.099_596_024_527_226,
    lng: 113.769_574_897_051_29,
    name: '总部办公室',
    radius: 100,
  },
  {
    lat: 23.113_378_978_428_83,
    lng: 113.573_345_088_972_27,
    name: '广州新塘园区夏埔二',
    radius: 100,
  },
  {
    lat: 23.033_413_470_702_452,
    lng: 114.142_578_383_666_77,
    name: '桥头十一宏威',
    radius: 100,
  },
  {
    lat: 22.806_162_951_878_903,
    lng: 113.813_421_727_962_14,
    name: '东莞同兴园区',
    radius: 100,
  },
  {
    lat: 23.180_910_025_718_41,
    lng: 113.684_951_553_631_12,
    name: '广州荔新',
    radius: 100,
  },
  {
    lat: 22.936_352_751_584_29,
    lng: 113.149_505_685_088_98,
    name: '佛山乐从园区',
    radius: 100,
  },
  {
    lat: 23.107_068_675_711_43,
    lng: 113.587_792_446_653_94,
    name: '广州西州二园区',
    radius: 100,
  },
  {
    lat: 22.770_193_354_689_752,
    lng: 114.375_510_515_262_69,
    name: '深圳坪山23园区',
    radius: 100,
  },
  {
    lat: 23.107_068_675_711_43,
    lng: 113.587_792_446_653_94,
    name: '广州园区（西州一）',
    radius: 100,
  },
  {
    lat: 22.893_815_468_623_426,
    lng: 112.995_006_389_970_56,
    name: '佛山九江园区',
    radius: 100,
  },
];

// 保持向后兼容
export const officeLocation = officeLocations[0];

export const BAIDU_MAP_AK = 'Ry6GDxG4wyEdT89fOKfZJQ5tlUeDPm3S';
